#各料理のカロリーをディクショナリ（辞書で整理）
calorie_dictionary={"ご飯":"550","パン":"120","かつ丼":"893","親子丼":"731","天丼":"805","牛丼":"909","ウナギ丼":"754","卵丼":"630",
"鉄火丼":"649","ねぎとろ丼":"786","中華丼":"841","五目チラシ":"618","刺身定食":"489","あじの塩焼き定食":"480","ブリの照り焼き定食":"646",
"サバのみそ煮定食":"687","生姜焼き定食":"789","鶏の照焼定食":"776","雑炊":"336","天ぷらそば":"459","ざるそば":"284","かけそば":"324",
"たぬきそば":"376","きつねうどん":"382","月見うどん":"419","焼きそば":"570","お好み焼き":"553","たこ焼き":"270","カキフライ":"299",
"ミートソーススパゲッティ":"597","カルボナーラスパゲッティ":"830","ペペロンチーノスパゲッティ":"561","ピザ":"538","ハンバーガー":"300",
"フライドポテト":"194","ビーフカレー":"954","チキンカレー":"690","野菜カレー":"686","カツカレー":"957","ドライカレー":"615",
"ハヤシライス":"728","オムライス":"843","ハンバーグ":"437","ロールキャベツ":"264","ラーメン":"443","塩ラーメン":"401","みそラーメン":"477",
"五目ラーメン":"665","冷やし中華":"467","チャーハン":"754","ビビンバ":"550","酢豚":"467","餃子":"423","春巻き":"369","肉まん":"201",
"オレンジジュース":"82","コーヒー":"7","クリームソーダ":"137","ミルクティー":"68","アイスクリーム":"196","コーヒーゼリー":"136",
"杏仁豆腐":"125","シュークリーム":"209","ショートケーキ":"292","あんみつ":"247","みたらし団子":"118","どら焼き":"256","たい焼き":"211"}

#利用者情報入力
x=int(input("あなたの年齢を教えてください:"))
y=int(input("男性なら1を、女性なら2を入力してください:"))
z=int(input("普段沢山運動されますかそうなら1を、違うなら2を入力してください:"))

if y==1:
    if 6<=x<=9:
        calorie_max=2000
    elif x>=70:
        if z==1:
            calorie_max=2400
        else:
            calorie_max=2000
    elif 10<=x<=11:
        calorie_max=2400
    elif 12<=x<=69:
        if z==2:
            calorie_max=2400
        else:
            calorie_max=3000
else:
    if 6<=x<=11:
        calorie_max=2000
    elif x>=70:
        calorie_max=2000
    elif 12<=x<=69:
        if z==1:
            calorie_max=2400
        else:
            calorie_max=2000

print("あなたが摂取してカロリーは{}です。".format(calorie_max))
print("=================")
print("あなたの食べ物ものについて教えてください")
breakfast=str(input("朝食を教えてください："))
lunch=str(input("昼食を教えてください："))
dinner=str(input("夕食を教えてください："))
breakfast_calorie=int(calorie_dictionary[breakfast])
lunch_calorie=int(calorie_dictionary[lunch])
dinner_calorie=int(calorie_dictionary[dinner])

#カロリーの総量比較
calorie_intakes=breakfast_calorie+lunch_calorie+dinner_calorie
print("あなたが今日、摂取したカロリーの総量は{}キロカロリーです。".format(calorie_intakes))
calorie_difference=calorie_intakes-calorie_max

if -200<=calorie_difference<=200:
    print("ちょうどいい摂取量です。")
elif calorie_difference>200:
    print("少しカロリーを抑えましょう")
else:
    print("もっとカロリーを摂取しましょう")
